tap "ankitpokhrel/jira-cli"
tap "arthurk/virt-manager"
tap "azure/functions"
tap "beeftornado/rmtree"
tap "bramstein/webfonttools"
tap "chase/tap"
tap "common-fate/granted"
tap "coursier/formulas"
tap "cxreiff/tap"
tap "felixkratz/formulae"
tap "guywaldman/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jdxcode/tap"
tap "joerdav/xc"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "mongodb/brew"
tap "nicholasdille/tap"
tap "nikolaeu/numi"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "saulpw/vd"
tap "snyk/tap"
tap "wtfutil/wtfutil"
tap "xwmx/taps"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Library for manipulating PNG images
brew "libpng"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Library and utilities for processing GIFs
brew "giflib"
# New file format for still image compression
brew "jpeg-xl"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU compiler collection
brew "gcc"
# C++ linear algebra library
brew "armadillo"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Archival front-end
brew "atool"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion", link: false
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Platform built on V8 to build network applications
brew "node"
# Language Server for Bash
brew "bash-language-server"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Generate compilation database for clang tooling
brew "bear"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Parser generator
brew "bison"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Draw boxes around text
brew "boxes"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Change macOS display brightness from the command-line
brew "brightness"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, lightweight programming language
brew "lua"
# Elegant Lua unit testing
brew "busted"
# Text-based personal organizer
brew "calcurse"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Incremental parsing library
brew "tree-sitter"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Work on automating classical cipher cracking in C
brew "cifer"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Unit Testing Framework for C and C++
brew "cutter-cli", link: false
# Dart Language SDK, including the VM, dart2js, core libraries, and more
brew "dart-sdk"
# Debugger for the Go programming language
brew "delve"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# TCP over DNS tunnel
brew "dns2tcp"
# Standard XML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# TUI todo manager
brew "dooit"
# .NET Core
brew "dotnet"
# Generate documentation for several programming languages
brew "doxygen"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# General purpose Language Server
brew "efm-langserver"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# CLI tool for quick access to files and directories
brew "fasd"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# X11 image viewer
brew "feh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Render markdown on the CLI
brew "glow"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Ping, but with a graph
brew "gping"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Thin layer of graphic data types
brew "graphene"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Numerical library for C and C++
brew "gsl"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# C library for the Public Suffix List
brew "libpsl"
# HTTP client/server library for GNOME
brew "libsoup"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Development framework for multimedia applications
brew "gstreamer"
# Text view with syntax, undo/redo, and text marks
brew "gtksourceview4"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# File format designed to store large amounts of data
brew "hdf5"
# Post-modern modal text editor
brew "helix"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tool to report network interface bandwidth
brew "ifstat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert JPG images to ASCII
brew "jp2a"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Statically typed programming language for the JVM
brew "kotlin"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# CLI for managing LaunchDarkly feature flags
brew "ldcli"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Operating System information database
brew "libosinfo"
# Postgres C API library
brew "libpq"
# HTTP client/server library for GNOME
brew "libsoup@2"
# C virtualization API
brew "libvirt", restart_service: :changed
# GNOME XML library
brew "libxml2"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Powerful, lightweight programming language
brew "lua@5.3"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Fly through your shell history
brew "mcfly"
# Terminal-based visual file manager
brew "midnight-commander"
# High Performance, Kubernetes Native Object Storage
brew "minio"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Cross platform, open source .NET development framework
brew "mono"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Open source relational database management system
brew "mysql-client"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Port scanning utility for large networks
brew "nmap"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Pager/text based browser
brew "w3m"
# Command-line and local web note-taking, bookmarking, and archiving
brew "nb"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Space Invaders in the terminal
brew "ninvaders"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Open source suite of directory software
brew "openldap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php"
# New zlib (gzip, deflate) compatible compressor
brew "zopfli"
# Parallel gzip
brew "pigz"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Print info and check PNG, JNG, and MNG files
brew "pngcheck"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Command-line tool for managing long-running shell commands
brew "pueue"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt@5", link: true
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GNU's Restricted User SHell
brew "rush"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Tool for shell commands execution, visualization and alerting
brew "sampler"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# JVM-based programming language
brew "scala@2.12"
# Software for mathematics, science, and engineering
brew "scipy"
# Interactive find and replace in the terminal
brew "scooter"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SOcket CAT: netcat on steroids
brew "socat"
# Diff images from the command-line
brew "spaceman-diff"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# GTK client/libraries for SPICE
brew "spice-gtk"
# Terminal-based client for Spotify
brew "spotify-tui"
# Spotify daemon
brew "spotifyd", restart_service: :changed
# Language Server for SQL
brew "sql-language-server"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# High-performance system programming language
brew "swift"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Feature-rich console based todo list manager
brew "task"
# Programmatically correct mistyped console commands
brew "thefuck"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# CLI tool that moves files or folder to the trash
brew "trash"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extraction utility for .zip compressed archives
brew "unzip"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Visual Binary Diff
brew "vbindiff"
# Your CLI home video recorder
brew "vhs"
# Image processing library
brew "vips"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Terminal emulator widget used by GNOME terminal
brew "vte3"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Weather app for the terminal
brew "wego"
# Internet file retriever
brew "wget"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Personal information dashboard for your terminal
brew "wtfutil"
# Access X11 clipboards from the command-line
brew "xclip"
# Format XML documents
brew "xmlformat"
# PDF viewer
brew "xpdf", link: false
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Language Server for Yaml Files
brew "yaml-language-server"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Command-line tool that draw plots on the terminal
brew "youplot"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Plain text note-taking assistant
brew "zk"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Convert existing TrueType/OpenType fonts to WOFF format
brew "bramstein/webfonttools/sfnt2woff"
# WOFF utilities with Zopfli compression
brew "bramstein/webfonttools/sfnt2woff-zopfli"
# Chromium-based browser that renders in Kitty
brew "chase/tap/awrit"
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Screensavers for your terminal
brew "cxreiff/tap/ttysvr"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Command line utility to make you a magician in the terminal
brew "guywaldman/tap/magic-cli"
# Self documenting task runner
brew "joerdav/xc/xc"
# Command-line tool to customize Spotify client
brew "khanhas/tap/spicetify-cli"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Terminal-based presentations using Pandoc
brew "nicholasdille/tap/patat-bin"
# Smart calculator
brew "nikolaeu/numi/numi-cli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Two-factor authentication software
cask "authy"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# 3D creation suite
cask "blender"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Elegant Facebook Messenger desktop app
cask "caprine"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Reverse engineering platform powered by Rizin
cask "cutter"
# Build desktop apps with JavaScript, HTML, and CSS
cask "electron"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
# CLI for GitKraken
cask "gitkraken-cli"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Vector graphics editor
cask "inkscape"
# GPU-based terminal emulator
cask "kitty"
# Application launcher
cask "leader-key"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Clipboard manager
cask "maccy"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# GameStream client
cask "moonlight"
# Neovim Client
cask "neovide-app"
# Tool for uploading images
cask "picgo", args: { appdir: "/Applications" }
# Command-line shell and scripting language
cask "powershell"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# PDF reader and note-taking application
cask "skim"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Music streaming service
cask "spotify", args: { appdir: "/Applications" }
cask "spotify-now-playing"
# System monitor for the menu bar
cask "stats"
# Customizable email client
cask "thunderbird"
# Open-source BitTorrent client
cask "transmission", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Multimedia player
cask "vlc", args: { appdir: "/Applications" }
# Terminal emulator
cask "wave"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Password for Safari", id: 1569813296
mas "Actions For Obsidian", id: 1659667937
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Aspen", id: 6475777033
mas "BetterSnapTool", id: 417375580
mas "Bible Study", id: 472790630
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Cardhop", id: 1290358394
mas "Clean Email", id: 1441250616
mas "cmdLab", id: 1226890450
mas "Copilot", id: 1447330651
mas "Dark Reader for Safari", id: 1438243180
mas "Dato", id: 1470584107
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "Devslopes", id: 1183088305
mas "Fantastical", id: 975937182
mas "Flow", id: 1423210932
mas "Focus City", id: 1468463467
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Image Vectorizer", id: 789656124
mas "Infuse", id: 1136220934
mas "Keeper Password Manager", id: 414781829
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Linearity Curve", id: 1219074514
mas "Malwarebytes Browser Guard", id: 1577761052
mas "Messenger", id: 1480068668
mas "Microsoft Word", id: 462054704
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "One Thing", id: 1604176982
mas "OTP Auth", id: 1471867429
mas "Pages", id: 409201541
mas "Parallels Client", id: 600925318
mas "Patterns", id: 429449079
mas "Perplexity", id: 6714467650
mas "Pluralsight", id: 431748264
mas "PopClip", id: 445189367
mas "PrettyJSON for Safari", id: 1445328303
mas "Prime Video", id: 545519333
mas "reMarkable", id: 1276493162
mas "Resident Evil 4", id: 6462360082
mas "Secure Private Browser + VPN", id: 1450809061
mas "Shapr3D", id: 1091675654
mas "Shortery", id: 1594183810
mas "Sitely", id: 863015334
mas "Slack", id: 803453959
mas "SoundSeer", id: 6497167012
mas "Speedtest", id: 1153157709
mas "Taskade", id: 1490048917
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "WakaTime Tracker", id: 1541422018
mas "Wayback Machine", id: 1472432422
mas "WiFi Explorer", id: 494803304
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
vscode "10nates.ollama-autocoder"
vscode "achil.vscode-javascript-repl"
vscode "adrianwilczynski.csharp-to-typescript"
vscode "aidencuneo.quokkasyntax"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alssys.interactive-scala"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "apollographql.vscode-apollo"
vscode "assisrmatheus.sidebar-markdown-notes"
vscode "asvetliakov.vscode-neovim"
vscode "atishay-jain.all-autocomplete"
vscode "atlassian.atlascode"
vscode "ayqy.browser"
vscode "bradymholt.pgformatter"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cobaltblu27.rainbow-highlighter"
vscode "codezombiech.gitignore"
vscode "ctf0.macros"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dendron.dendron"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dendron.dendron-paste-image"
vscode "devadvice.serverlessconsole"
vscode "doggy8088.quicktype-refresh"
vscode "donjayamanne.githistory"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "feiskyer.chatgpt-copilot"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.code-runner"
vscode "ghmcadams.lintlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grokjs.grok-js"
vscode "gruntfuggly.todo-tree"
vscode "hai.neovimsync"
vscode "hbenl.vscode-test-explorer"
vscode "holmescn.vscode-wordcount-cjk"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "infeng.vscode-react-typescript"
vscode "inu1255.easy-snippet"
vscode "jabacchetta.vscode-essentials"
vscode "jakearl.search-editor-apply-changes"
vscode "jasonlhy.hungry-delete"
vscode "jasonnutter.search-node-modules"
vscode "jeff-hykin.polacode-2019"
vscode "jkiviluoto.codejournal"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "jock.svg"
vscode "jojoee.scala-cheatsheet"
vscode "kiguchi.maplibre-vscode-extension"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kortina.vscode-markdown-notes"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "loiane.ts-extension-pack"
vscode "lostintangent.vsls-whiteboard"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mohsen1.prettify-json"
vscode "mongodb.mongodb-vscode"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "netcorext.uuid-generator"
vscode "nhoizey.gremlins"
vscode "noctarya.typescript-web-development-extension-pack"
vscode "orangex4.better-markdown-latex-shortcuts"
vscode "orangex4.hsnips"
vscode "orangex4.latex-sympy-calculator"
vscode "orangex4.markdown-notes-pack"
vscode "orangex4.python-brackets"
vscode "pajoma.vscode-journal"
vscode "pkief.material-product-icons"
vscode "pmneo.tsimporter"
vscode "pranaygp.vscode-css-peek"
vscode "psqq.nvim-edit"
vscode "ravioshankar.scala-gurus"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-statusbar-json-path"
vscode "scala-lang.scala"
vscode "scala-lang.scala-snippets"
vscode "scalameta.metals"
vscode "sharzyl.cjk-word-handler"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shortarrow.line-number-deco"
vscode "shyykoserhiy.vscode-spotify"
vscode "sketchbuch.vsc-quokka-statusbar"
vscode "slevesque.vscode-multiclip"
vscode "softwaredotcom.music-time"
vscode "spoonscen.es6-mocha-snippets"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "tabnine.tabnine-vscode"
vscode "telesoho.vscode-markdown-paste-image"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "threadheap.serverless-ide-vscode"
vscode "timvaneker.serverless-snippets"
vscode "tomoki1207.pdf"
vscode "undefined_publisher.cit-flow-copilot"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voldemortensen.rainbow-tags"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "vsls-contrib.gistfs"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "weijunyu.vscode-json-path"
vscode "xyz.local-history"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
