cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'wftutil/wtfutil'

brew 'ack'
brew 'azure-cli'
brew 'bash-completion'
brew 'coreutils'
brew 'fzf'
brew 'git'
brew 'go'
brew 'grc'
brew 'jp2a'
brew 'jq'
brew 'kubectx'
brew 'libgit2'
brew 'openssl'
brew 'asdf'
brew 'postgresql'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'rbenv'
brew 'shpotify'
brew 'spaceman-diff'
brew 'speedtest-cli'
brew 'tmux'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'boxes'
brew 'rich'
brew 'bat'
brew 'tldr'
brew 'fig'
brew 'docbook'
brew 'docbook-xsl'
brew 'exa'
brew 'eslint'
brew 'fd'
brew 'gawk'
brew 'fontconfig'
brew 'gh'
brew 'ghostscript'
brew 'git-delta'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnutls'
brew 'go'
brew 'gping'
brew 'graphite2'
brew 'guile'
brew 'harfbuzz'
brew 'jpeg-xl'
brew 'jq'
brew 'lazygit'
brew 'lua'
brew 'lua-language-server'
brew 'lua@5.3'
brew 'luajit'
brew 'mongodb-community'
brew 'mongodb-database-tools'
brew 'mongosh'
brew 'nmap'
brew 'openjpeg'
brew 'openldap'
brew 'pandoc'
brew 'prettier'
brew 'pyenv'
brew 'readline'
brew 'rbenv'
brew 'ripgrep'
brew 'spotify-tui'
brew 'sqlite'
brew 'thefuck'
brew 'taks'
brew 'timewarrior'
brew 'trash'
brew 'tree-sitter'
brew 'wtfutil'

cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'transmission' 
cask 'visual-studio-code'
cask 'vlc'
cask 'picgo'
