cask_args appdir: '/usr/local/bin'

tap 'homebrew/bundle'

brew 'ack'
brew 'azure-cli'
brew 'bash-completion'
brew 'coreutils'
brew 'fzf'
brew 'git'
brew 'go'
brew 'grc'
brew 'jp2a'
brew 'jq'
brew 'kubectx'
brew 'libgit2'
brew 'maven'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'rbenv'
brew 'shpotify'
brew 'spaceman-diff'
brew 'speedtest-cli'
brew 'tmux'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'boxes'
brew 'neovim'
brew 'xsel'
brew 'fd'
brew 'ssed'
brew 'ripgrep'
brew 'neovim'
brew 'stylua'
brew 'prettier'
brew 'delve'
brew 'lazygit'
brew 'pandoc'
brew 'unzip'
brew 'curl'
brew 'sqlite3'
brew 'trash-cli'
brew 'starship'

cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'transmission' 
cask 'visual-studio-code'
cask 'vlc'

  pip3 install pylint
  pip3 install pylint-django
  pip3 install django-stubs
  pip3 install autopep8
  pip3 install sqlformat
  pip3 install debugpy
  npm i -g live-server
  npm i -g picgo
